ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/МВ_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/ChartsOfCharacteristicTypes/МВ_ПереченьДополнительныхНастроек/МВ_ПереченьДополнительныхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>МВ_ПереченьДополнительныхНастроек</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РаботаСОператоромОКТО</name>
      <description>Работа с оператором ОКТО</description>
    </items>
    <items>
      <name>КаталогЧтенияВСД</name>
      <description>Каталог чтения ВСД</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОсновнойПоставщик</name>
      <description>Основной поставщик</description>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ЭтоЦентральнаяБаза</name>
      <description>Это центральная база</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Общая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/ManagerModule.bsl
// ФТО:ALNA 22.07.2019 30701

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	
	
Функция ПолучитьЗначения(НастройкаИлиМассивНастроек, Дата, Организация = Неопределено) Экспорт
	
	Если ТипЗнч(НастройкаИлиМассивНастроек) = Тип("ПланВидовХарактеристикСсылка.МВ_ПереченьДополнительныхНастроек") Тогда
		Настройки = Новый Массив;
		Настройки.Добавить(НастройкаИлиМассивНастроек);
	Иначе
		Настройки = НастройкаИлиМассивНастроек;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Настройки", Настройки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПВХ.Ссылка КАК Настройка,
	|	ЕСТЬNULL(Срез.Значение, ПВХ.ЗначениеПоУмолчанию) КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.МВ_ПереченьДополнительныхНастроек КАК ПВХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МВ_ДополнительныеНастройки.СрезПоследних(
	|				&Дата,
	|				Настройка В (&Настройки)
	|					И Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации_ХамелеонЦРПТ.ПустаяСсылка))) КАК Срез
	|		ПО ПВХ.Ссылка = Срез.Настройка
	|			И (ВЫБОР
	|				КОГДА ПВХ.Общая
	|					ТОГДА Срез.Организация = ЗНАЧЕНИЕ(Справочник.Организации_ХамелеонЦРПТ.ПустаяСсылка)
	|				ИНАЧЕ Срез.Организация = &Организация
	|			КОНЕЦ)
	|ГДЕ
	|	ПВХ.Ссылка В(&Настройки)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();                                 
		Возврат Выборка.Значение;
	Иначе
		Значения = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			Значения.Вставить(Выборка.Настройка, Выборка.Значение);
		КонецЦикла;
		Возврат Значения;
	КонецЕсли;
	
КонецФункции

Функция ФорматнаяСтрокаНастройки(Настройка) Экспорт
	
	СтрокаФормата = "БЛ=Нет; БИ=Да; ";
	
	ТипНастройки = Настройка.ТипЗначения;
	Если ТипНастройки.СодержитТип(Тип("Дата")) Тогда
		ЧастиДатыНастройки = ТипНастройки.КвалификаторыДаты.ЧастиДаты;
		Если ЧастиДатыНастройки = ЧастиДаты.Время Тогда
			СтрокаФормата = СтрокаФормата + "ДЛФ=T";
		ИначеЕсли ЧастиДатыНастройки = ЧастиДаты.Дата Тогда
			СтрокаФормата = СтрокаФормата + "ДЛФ=DD";
		Иначе
			СтрокаФормата = СтрокаФормата + "ДЛФ=DDT";
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаФормата;
	
КонецФункции

//++ ФТО:SOAL 04.10.2019 32239
Функция СписокПолейСРежимомПароль() Экспорт
	
	ПВХ = ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек;
	МассивПолей = Новый Массив;
//	МассивПолей.Добавить(ПВХ.СолвоПароль);
	//++ ФТО:ALNA 10.10.2019 32391
//	МассивПолей.Добавить(ПВХ.ПарольДляWebСервисаМВ_КонтрольДебиторскойЗадолженности);
	//-- ФТО:ALNA 10.10.2019
	
	//++ ФТО:STAS 08.11.2019 33453
	//++ МВ:Увин 25.06.2020 33473 Для диалога Тамбова и Белгорода пароль не нужен.
	//МассивПолей.Добавить(ПВХ.ДиалогПароль);
	//МассивПолей.Добавить(ПВХ.СтарыйОсколПароль);
	//МассивПолей.Добавить(ПВХ.ТамбовПароль);
	//МассивПолей.Добавить(ПВХ.БелгородПароль);
//	МассивПолей.Добавить(ПВХ.СтарыйОсколПароль);
	//-- МВ:Увин 25.06.2020
	//-- ФТО:STAS 08.11.2019
	
	//++ ФТО:DANC 18.03.2020 37071
//	МассивПолей.Добавить(ПВХ.EPS_Пароль);
	//-- ФТО:DANC 18.03.2020
	
	//++ ФТО:KRAV 01.09.2020 42851
//	МассивПолей.Добавить(ПВХ.ПарольДляОбменаСУПП);
	//-- ФТО:KRAV 01.09.2020
	
	//++ МВ:Овчинников 26.11.2020 45565
//	МассивПолей.Добавить(ПВХ.ТиС77Пароль);
	//-- МВ:Овчинников 26.11.2020

	//++ ФТО:DARS 12.03.2021 46134
//	МассивПолей.Добавить(ПВХ.Цербер_ПарольWebСервиса);
	//-- ФТО:DARS 12.03.2021
	
	Возврат МассивПолей;
	 	
КонецФункции

Функция ВключатьРежимПароляДляНастройки(Настройка) Экспорт
	
	СписокПолей = СписокПолейСРежимомПароль();
	
	Возврат (СписокПолей.Найти(Настройка) <> Неопределено);
	 	
КонецФункции	

Процедура УстановитьУсловноеОформлениеДляПароля(Форма, ОформляемоеПоле, ПолеЗначение, ПолеНастройка, ПолеПароль) Экспорт
	
	ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ОформляемоеПоле); 
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, ПолеНастройка, ВидСравненияКомпоновкиДанных.Равно, ПолеПароль,, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, ПолеЗначение, ВидСравненияКомпоновкиДанных.Заполнено, ,, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "****************");
		
КонецПроцедуры 
//-- ФТО:SOAL 04.10.2019

#КонецОбласти

#КонецЕсли
